Just ran into this issue..

My use case is :
I have the schema file and terraform in the same repo..

When the schema is first created, terraform runs fine and creates the corresponding resource in confluent..

When there is a change to the schema like adding a new field for instance.
Terraform will try to replace the existing schema..

```bash
 # module.kafka.confluent_schema.schemas["examples.v1alpha.record"] must be replaced
-/+ resource "confluent_schema" "schemas" {
      ~ id                = "xxx-xxx/examples.v1alpha.record/100003" -> (known after apply)
      ~ schema            = <<-EOT # forces replacement
            syntax = "proto3";
            package examples.v1alpha;

            message SomeRecord {
              string value = 1;
          +   string value2 = 2;
            }
        EOT
      ~ schema_identifier = 100003 -> (known after apply)
      ~ version           = 2 -> (known after apply)
```


I would expect the existing schema to evolve to the new version instead of being deleted and a new version added.